tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/i2cs_regs.h
#define MXC_F_I2CS_INTEN_BYTE18_POS                         18                                                                       /**< BYTE18 Position                 */ 
#define MXC_F_I2CS_INTEN_BYTE18                             ((uint32_t)(0x00000001UL << MXC_F_I2CS_INTEN_BYTE18_POS))                /**< BYTE18 Mask                     */ 
#define MXC_F_I2CS_INTEN_BYTE19_POS                         19                                                                       /**< BYTE19 Position                 */ 
#define MXC_F_I2CS_INTEN_BYTE19                             ((uint32_t)(0x00000001UL << MXC_F_I2CS_INTEN_BYTE19_POS))                /**< BYTE19 Mask                     */ 
#define MXC_F_I2CS_INTEN_BYTE20_POS                         20                                                                       /**< BYTE20 Position                 */ 
#define MXC_F_I2CS_INTEN_BYTE20                             ((uint32_t)(0x00000001UL << MXC_F_I2CS_INTEN_BYTE20_POS))                /**< BYTE20 Mask                     */ 
#define MXC_F_I2CS_INTEN_BYTE21_POS                         21                                                                       /**< BYTE21 Position                 */ 
#define MXC_F_I2CS_INTEN_BYTE21                             ((uint32_t)(0x00000001UL << MXC_F_I2CS_INTEN_BYTE21_POS))                /**< BYTE21 Mask                     */ 
#define MXC_F_I2CS_INTEN_BYTE22_POS                         22                                                                       /**< BYTE22 Position                 */ 
#define MXC_F_I2CS_INTEN_BYTE22                             ((uint32_t)(0x00000001UL << MXC_F_I2CS_INTEN_BYTE22_POS))                /**< BYTE22 Mask                     */ 
#define MXC_F_I2CS_INTEN_BYTE23_POS                         23                                                                       /**< BYTE23 Position                 */ 
#define MXC_F_I2CS_INTEN_BYTE23                             ((uint32_t)(0x00000001UL << MXC_F_I2CS_INTEN_BYTE23_POS))                /**< BYTE23 Mask                     */ 
#define MXC_F_I2CS_INTEN_BYTE24_POS                         24                                                                       /**< BYTE24 Position                 */ 
#define MXC_F_I2CS_INTEN_BYTE24                             ((uint32_t)(0x00000001UL << MXC_F_I2CS_INTEN_BYTE24_POS))                /**< BYTE24 Mask                     */ 
#define MXC_F_I2CS_INTEN_BYTE25_POS                         25                                                                       /**< BYTE25 Position                 */ 
#define MXC_F_I2CS_INTEN_BYTE25                             ((uint32_t)(0x00000001UL << MXC_F_I2CS_INTEN_BYTE25_POS))                /**< BYTE25 Mask                     */ 
#define MXC_F_I2CS_INTEN_BYTE26_POS                         26                                                                       /**< BYTE26 Position                 */ 
#define MXC_F_I2CS_INTEN_BYTE26                             ((uint32_t)(0x00000001UL << MXC_F_I2CS_INTEN_BYTE26_POS))                /**< BYTE26 Mask                     */ 
#define MXC_F_I2CS_INTEN_BYTE27_POS                         27                                                                       /**< BYTE27 Position                 */ 
#define MXC_F_I2CS_INTEN_BYTE27                             ((uint32_t)(0x00000001UL << MXC_F_I2CS_INTEN_BYTE27_POS))                /**< BYTE27 Mask                     */ 
#define MXC_F_I2CS_INTEN_BYTE28_POS                         28                                                                       /**< BYTE28 Position                 */ 
#define MXC_F_I2CS_INTEN_BYTE28                             ((uint32_t)(0x00000001UL << MXC_F_I2CS_INTEN_BYTE28_POS))                /**< BYTE28 Mask                     */ 
#define MXC_F_I2CS_INTEN_BYTE29_POS                         29                                                                       /**< BYTE29 Position                 */ 
#define MXC_F_I2CS_INTEN_BYTE29                             ((uint32_t)(0x00000001UL << MXC_F_I2CS_INTEN_BYTE29_POS))                /**< BYTE29 Mask                     */ 
#define MXC_F_I2CS_INTEN_BYTE30_POS                         30                                                                       /**< BYTE30 Position                 */ 
#define MXC_F_I2CS_INTEN_BYTE30                             ((uint32_t)(0x00000001UL << MXC_F_I2CS_INTEN_BYTE30_POS))                /**< BYTE30 Mask                     */ 
#define MXC_F_I2CS_INTEN_BYTE31_POS                         31                                                                       /**< BYTE31 Position                 */ 
#define MXC_F_I2CS_INTEN_BYTE31                             ((uint32_t)(0x00000001UL << MXC_F_I2CS_INTEN_BYTE31_POS))                /**< BYTE31 Mask                     */ 
/**@} end group I2CS_INTEN */
/**
 * @ingroup  i2cs_registers
 * @defgroup I2CS_DATA_BYTE_Register I2CS_DATA_BYTE
 * @brief    Field Positions and Bit Masks for the I2CS_DATA_BYTE register
 * @{
 */
#define MXC_F_I2CS_DATA_BYTE_DATA_FIELD_POS                 0                                                                       /**< DATA_FIELD Position         */
#define MXC_F_I2CS_DATA_BYTE_DATA_FIELD                     ((uint32_t)(0x000000FFUL << MXC_F_I2CS_DATA_BYTE_DATA_FIELD_POS))       /**< DATA_FIELD                  */
#define MXC_F_I2CS_DATA_BYTE_READ_ONLY_FL_POS               8                                                                       /**< READ_ONLY_FL Position       */
#define MXC_F_I2CS_DATA_BYTE_READ_ONLY_FL                   ((uint32_t)(0x00000001UL << MXC_F_I2CS_DATA_BYTE_READ_ONLY_FL_POS))     /**< READ_ONLY_FL                */
#define MXC_F_I2CS_DATA_BYTE_DATA_UPDATED_FL_POS            9                                                                       /**< DATA_UPDATED_FL Position    */
#define MXC_F_I2CS_DATA_BYTE_DATA_UPDATED_FL                ((uint32_t)(0x00000001UL << MXC_F_I2CS_DATA_BYTE_DATA_UPDATED_FL_POS))  /**< DATA_UPDATED_FL             */
/**@} end group I2CS_DATA_BYTE */

#ifdef __cplusplus
}
#endif

#endif   /* _MXC_I2CS_REGS_H_ */
